app/controllers/movies_controller.rb

SELECT DISTINCT "movies"."rating" FROM "movies"
---
  def index
    #@movies = Movie.all
    @all_ratings = Movie.uniq.pluck(:rating).sort

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13') ORDER BY release_date
---
    end


    @movies = Movie.where(:rating => @saved_ratings.keys).order(@sort)